martin8947/mcux_stage/mcxw_stage/drivers/fsl_spc.c
    status_t status = kStatus_Success;

    status = SPC_SetLowPowerModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
    if (status == kStatus_Success)
    {
        status = SPC_SetLowPowerModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
        if (status == kStatus_Success)
        {
            status = SPC_SetLowPowerModeDCDCRegulatorConfig(base, &config->DCDCOption);
            if (status == kStatus_Success)
            {
                status = SPC_SetLowPowerModeBandgapmodeConfig(base, config->bandgapMode);
                if (status == kStatus_Success)
                {
                    SPC_EnableLowPowerModeCMPBandgapBufferMode(base, config->lpBuff);
                    SPC_EnableLowPowerModeLowPowerIREF(base, config->lpIREF);
                    SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(base, config->CoreIVS);
                }
            }
        }
    }

    return status;
}

/*!
 * brief Set the SRAM operate voltage level.
 *
 * param base SPC peripheral base address.
 * param voltage Target SRAM operate voltage level, please refer to spc_sram_operat_voltage_t.
 *
 * retval kStatus_Success Successfully configured.
 * retval kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetSRAMOperateVoltage(SPC_Type *base, spc_sram_operat_voltage_t voltage)
{
#if SPC_SRAM_ACK_TIMEOUT
    uint32_t timeout = SPC_SRAM_ACK_TIMEOUT;
#endif

    /* Configure SRAM to support new voltage level. */
    base->SRAMCTL = ((base->SRAMCTL & ~SPC_SRAMCTL_VSM_MASK) | (SPC_SRAMCTL_VSM(voltage)));

    /* Request SRAM voltage update. */
    base->SRAMCTL |= SPC_SRAMCTL_REQ_MASK;

    /* Wait for SRAM voltage update complete. */
    while ((base->SRAMCTL & SPC_SRAMCTL_ACK_MASK) == 0U)
    {
#if SPC_SRAM_ACK_TIMEOUT
        if ((--timeout) == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    /* Clear SRAM voltage update request. */
    base->SRAMCTL &= ~SPC_SRAMCTL_REQ_MASK;

    return kStatus_Success;
}

#if (defined(FSL_FEATURE_SPC_HAS_HP_CFG_REG) && FSL_FEATURE_SPC_HAS_HP_CFG_REG)
/*!
 * brief Set bandgap mode in high power mode.
 * 
 * param base SPC peripheral base address.
 * param mode Specify the bandgap mode in high power mode.
 *
 * retval kStatus_SPC_BandgapModeWrong The Bandgap can not be disabled in high power mode.
 * retval kStatus_Success Config Bandgap mode in high power mode successful.
 */
status_t SPC_SetHighPowerModeBandgapModeConfig(SPC_Type *base, spc_bandgap_mode_t mode)
{
    uint32_t reg;
    uint32_t state;

    reg = base->HP_CFG;

    if (mode == kSPC_BandgapDisabled)
    {
        state = SPC_GetHighPowerModeVoltageDetectStatus(base);

        /* If any of the LVD/HVDs are kept enabled, bandgap mode must be enabled with buffer disabled. */
        if (state != 0UL)
        {
            return kStatus_SPC_BandgapModeWrong;
        }

        /* The bandgap mode must be enabled if any regulators' drive strength set as Normal. */
        if (((base->HP_CFG & SPC_HP_CFG_SYSLDO_VDD_DS_MASK) ==
                SPC_HP_CFG_SYSLDO_VDD_DS(kSPC_SysLDO_NormalDriveStrength)) ||
            ((base->HP_CFG & SPC_HP_CFG_DCDC_VDD_DS_MASK) == SPC_HP_CFG_DCDC_VDD_DS(kSPC_DCDC_NormalDriveStrength)))
        {
            return kStatus_SPC_BandgapModeWrong;
        }

        /* state of GLITCH_DETECT_DISABLE will be ignored if bandgap is disabled. */
        if ((base->HP_CFG & SPC_HP_CFG_GLITCH_DETECT_DISABLE_MASK) == 0UL)
        {
            return kStatus_SPC_BandgapModeWrong;
        }
    #if defined(FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS) && FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS
            if ((base->HP_CFG & SPC_HP_CFG_CORELDO_VDD_DS_MASK) ==
                SPC_HP_CFG_CORELDO_VDD_DS(kSPC_CoreLDO_NormalDriveStrength))
            {
                return kStatus_SPC_BandgapModeWrong;
            }
    #endif /* FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS */
    }

    reg &= ~SPC_HP_CFG_BGMODE_MASK;
    reg |= SPC_HP_CFG_BGMODE(mode);

    base->HP_CFG = reg;

    return kStatus_Success;
}

/*!
 * brief Configure CORE LDO regulator in high power mode.
 * 
 * param base SPC peripheral base address.
 * param option Pointer to the CORE LDO regulator configuration, please refer to @ref spc_hp_mode_core_ldo_option_t.
 *
 * retval #kStatus_Success Config Core LDO regulator in High power mode successful.
 * retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * retval #kStatus_SPC_CORELDOLowDriveStrengthIgnore If any voltage detect enabled, core_ldo's drive strength can not
 * set to low.
 * retval #kStatus_SPC_CORELDOVoltageWrong The selected voltage level in high power mode is not allowed.
 * retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeCoreLDORegulatorConfig(SPC_Type *base,  spc_hp_mode_core_ldo_option_t *option)
{
    spc_core_ldo_voltage_level_t preVoltage;
    uint32_t state;

#if SPC_BUSY_TIMEOUT
    uint32_t timeout = SPC_BUSY_TIMEOUT;
#endif

#if defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY 
    if ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    if ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
        /*
         * $Line Coverage Justification$
         * $ref spc_c_ref_1$.
         */
        return kStatus_SPC_Busy;
    }

#if defined(FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS) && FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS
    if (option->CoreLDODriveStrength == kSPC_CoreLDO_LowDriveStrength)
    {
        /* If any voltage detect feature is enabled in High power mode, then CORE_LDO's drive strength must not set to low.
         */
        state = SPC_GetHighPowerModeVoltageDetectStatus(base);
        if (state != 0UL)
        {
            return kStatus_SPC_CORELDOLowDriveStrengthIgnore;
        }

        preVoltage = SPC_GetHighPowerModeCoreLDOVDDVoltageLevel(base);
        if ((option->CoreLDOVoltage != kSPC_CoreLDO_MidDriveVoltage) && (preVoltage != option->CoreLDOVoltage))
        {
            return kStatus_SPC_CORELDOVoltageSetFail;
        }

        base->HP_CFG &= ~SPC_HP_CFG_CORELDO_VDD_DS_MASK;
    }
#endif /* FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS */
    base->HP_CFG = ((base->HP_CFG & ~SPC_HP_CFG_CORELDO_VDD_LVL_MASK) |
                        SPC_HP_CFG_CORELDO_VDD_LVL(option->CoreLDOVoltage));

