martin8947/mcux_stage/mcxw_stage/drivers/fsl_spc.c
    /*
     * $Branch Coverage Justification$
     * $ref spc_c_ref_1$.
     */
#if defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY 
    while ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    while ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
#if SPC_BUSY_TIMEOUT
        if ((--timeout) == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

/*!
 * brief Configure System LDO regulator in high power mode.
 * 
 * param base SPC peripheral base address.
 * param option Pointer to the SYSTEM LDO regulator configuration, please refer to @ref spc_hp_mode_sys_ldo_option_t.
 *
 * retval #kStatus_Success Config System LDO regulator in Active power mode successful.
 * retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * retval #kStatus_SPC_SYSLDOOverDriveVoltageFail Fail to regulator to Over Drive Voltage.
 * retval #kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeSystemLDORegulatorConfig(SPC_Type *base, spc_hp_mode_sys_ldo_option_t *option)
{
    assert(option != NULL);

    uint32_t reg;
    uint32_t state;

#if SPC_BUSY_TIMEOUT
    uint32_t timeout = SPC_BUSY_TIMEOUT;
#endif

#if (defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY) 
    if ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    if ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
        /*
         * $Line Coverage Justification$
         * $ref spc_c_ref_1$.
         */
        return kStatus_SPC_Busy;
            
    }

    if (option->SysLDODriveStrength == kSPC_SysLDO_NormalDriveStrength)
    {
        /* When select System LDO voltage level to Over Drive voltage, The HVD of System LDO must be disabled. */
        if (((base->HP_CFG & SPC_HP_CFG_SYS_HVDE_MASK) != 0UL) &&
            (option->SysLDOVoltage == kSPC_SysLDO_OverDriveVoltage))
        {
            return kStatus_SPC_SYSLDOOverDriveVoltageFail;
        }
    }
    else
    {
        state = (uint32_t)SPC_GetHighPowerModeVoltageDetectStatus(base);

        /* If any HVD/LVDs are kept enabled write to set drive strength to low will be ignored. */
        if (state != 0UL)
        {
            return kStatus_SPC_SYSLDOLowDriveStrengthIgnore;
        }

        /* If select voltage level as Over Drive Voltage, Drive Strength can not be set to low. */
        if (option->SysLDOVoltage == kSPC_SysLDO_OverDriveVoltage)
        {
            return kStatus_SPC_SYSLDOLowDriveStrengthIgnore;
        }
    }

    reg = base->HP_CFG;
    reg &= ~(SPC_HP_CFG_SYSLDO_VDD_DS_MASK | SPC_HP_CFG_SYSLDO_VDD_LVL_MASK);
    reg |= SPC_HP_CFG_SYSLDO_VDD_DS(option->SysLDODriveStrength) |
           SPC_HP_CFG_SYSLDO_VDD_LVL(option->SysLDOVoltage);

    base->HP_CFG = reg;

    /*
     * $Branch Coverage Justification$
     * $ref spc_c_ref_1$.
     */
#if defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY 
    while ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    while ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
#if SPC_BUSY_TIMEOUT
        if ((--timeout) == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

/*!
 * brief Configure DCDC regulator in high power mode.
 * 
 * param base SPC peripheral base address.
 * param option Pointer to the DCDC regulator configuration, please refer to @ref spc_hp_mode_dcdc_option_t.
 *
 * retval #kStatus_Success Config DCDC regulator in Active power mode successful.
 * retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * retval #kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * retval #kStatus_Timeout Timeout occurs while waiting completion.
 */
status_t SPC_SetHighPowerModeDCDCRegulatorConfig(SPC_Type *base, spc_hp_mode_dcdc_option_t *option)
{
    assert(option != NULL);

    uint32_t reg;
    uint32_t state;

#if SPC_BUSY_TIMEOUT
    uint32_t timeout = SPC_BUSY_TIMEOUT;
#endif

#if defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY 
    if ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    if ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
        /*
         * $Line Coverage Justification$
         * $ref spc_c_ref_1$.
         */
        return kStatus_SPC_Busy;
    }

    if (option->DCDCDriveStrength == kSPC_DCDC_LowDriveStrength)
    {
        state = (uint32_t)SPC_GetHighPowerModeVoltageDetectStatus(base);
        /* If any HVD/LVDs are kept enabled write to set drive strength to low will be ignored. */
        if (state != 0UL)
        {
            return kStatus_SPC_DCDCLowDriveStrengthIgnore;
        }
    }

    reg = base->HP_CFG;
    reg &= ~(SPC_HP_CFG_DCDC_VDD_LVL_MASK | SPC_HP_CFG_DCDC_VDD_DS_MASK);
    reg |= SPC_HP_CFG_DCDC_VDD_DS(option->DCDCDriveStrength) | SPC_HP_CFG_DCDC_VDD_LVL(option->DCDCVoltage);

    base->HP_CFG = reg;

    /*
     * $Branch Coverage Justification$
     * $ref spc_c_ref_1$.
     */
#if defined(FSL_FEATURE_SPC_HAS_SC_REG_BUSY ) && FSL_FEATURE_SPC_HAS_SC_REG_BUSY 
    while ((base->SC & SPC_SC_REG_BUSY_MASK) != 0UL)
#else
    while ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
#endif
    {
#if SPC_BUSY_TIMEOUT
        if ((--timeout) == 0U)
        {
            return kStatus_Timeout;
        }
#endif
    }

    return kStatus_Success;
}

/*!
 * brief Set configuration of regulators in high power mode.
 * 
 * param base SPC peripheral base address.
 * param config Pointer to the regulator configuration, please refer to @ref spc_hp_mode_regulators_config_t.
 *
 * retval kStatus_Success Config regulators in High power mode successful.
 * retval kStatus_SPC_BandgapModeWrong The bandgap mode setting in high power mode is wrong.
 * retval kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * retval kStatus_SPC_CORELDOVoltageWrong The selected voltage level in high mode is not allowed.
 * retval kStatus_SPC_SYSLDOOverDriveVoltageFail Fail to regulator to Over Drive Voltage.
 * retval kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 * retval kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low will be ignored.
 */
status_t SPC_SetHighPowerModeRegulatorsConfig(SPC_Type *base, spc_hp_mode_regulators_config_t *config)
{
    assert(config != NULL);

    status_t status;

    status = SPC_SetHighPowerModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
    if (status == kStatus_Success)
    {
        status = SPC_SetHighPowerModeDCDCRegulatorConfig(base, &config->DCDCOption);
        if (status == kStatus_Success)
        {
            status = SPC_SetHighPowerModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
            if (status == kStatus_Success)
            {
                status = SPC_SetHighPowerModeBandgapModeConfig(base, config->bandgapMode);
                if (status == kStatus_Success)
                {
                    SPC_EnableHighPowerModeCMPBandgapBuffer(base, config->lpBuff);
                }
            }
        }
    }
    return status;
}

#endif /* (defined(FSL_FEATURE_SPC_HAS_HP_CFG_REG) && FSL_FEATURE_SPC_HAS_HP_CFG_REG) */
